Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes
The SectionMarkTagAttributes class contains attributes for section mark tags.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes.ShowOnSide
The side(s) on which the tag is shown.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes.TagRotation
The policy for the tag rotation.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes.#ctor
Creates a new section mark tag attributes instance.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes.#ctor(Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes.TagShowOnSide,Tekla.Structures.Drawing.TagLocation,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes.TagTextRotation,Tekla.Structures.Drawing.ContainerElement)
Creates a new section mark tag attributes instance with the given information.
showOnSide: The side(s) on which to show the tag to be used.
location: The location of the mark tag to be used.
offset: The offset of the mark tag to be used.
rotation: The policy for text rotation of the mark tag to be used.
tagContent: The content of the mark tag to be used.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.